MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BLE2_REG.h
/*
** ###################################################################
**     Processors:          KW45B41Z52AFPA
**                          KW45B41Z52AFTA
**                          KW45B41Z53AFPA
**                          KW45B41Z53AFTA
**                          KW45B41Z82AFPA
**                          KW45B41Z82AFTA
**                          KW45B41Z83AFPA
**                          KW45B41Z83AFPA_NBU
**                          KW45B41Z83AFTA
**                          KW45B41Z83AFTA_NBU
**                          KW45Z41052AFPA
**                          KW45Z41052AFTA
**                          KW45Z41053AFPA
**                          KW45Z41053AFTA
**                          KW45Z41082AFPA
**                          KW45Z41082AFTA
**                          KW45Z41083AFPA
**                          KW45Z41083AFTA
**
**     Version:             rev. 1.0, 2020-05-12
**     Build:               b240715
**
**     Abstract:
**         CMSIS Peripheral Access Layer for BLE2_REG
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2020-05-12)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file BLE2_REG.h
 * @version 1.0
 * @2025-05-16 2020-05-12
 * @brief CMSIS Peripheral Access Layer for BLE2_REG
 *
 * CMSIS Peripheral Access Layer for BLE2_REG
 */

#if !defined(BLE2_REG_H_)
#define BLE2_REG_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_KW45B41Z52AFPA) || defined(CPU_KW45B41Z52AFTA))
#include "KW45B41Z52_COMMON.h"
#elif (defined(CPU_KW45B41Z53AFPA) || defined(CPU_KW45B41Z53AFTA))
#include "KW45B41Z53_COMMON.h"
#elif (defined(CPU_KW45B41Z82AFPA) || defined(CPU_KW45B41Z82AFTA))
#include "KW45B41Z82_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA) || defined(CPU_KW45B41Z83AFTA))
#include "KW45B41Z83_COMMON.h"
#elif (defined(CPU_KW45B41Z83AFPA_NBU) || defined(CPU_KW45B41Z83AFTA_NBU))
#include "KW45B41Z83_NBU_COMMON.h"
#elif (defined(CPU_KW45Z41052AFPA) || defined(CPU_KW45Z41052AFTA))
#include "KW45Z41052_COMMON.h"
#elif (defined(CPU_KW45Z41053AFPA) || defined(CPU_KW45Z41053AFTA))
#include "KW45Z41053_COMMON.h"
#elif (defined(CPU_KW45Z41082AFPA) || defined(CPU_KW45Z41082AFTA))
#include "KW45Z41082_COMMON.h"
#elif (defined(CPU_KW45Z41083AFPA) || defined(CPU_KW45Z41083AFTA))
#include "KW45Z41083_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- BLE2_REG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BLE2_REG_Peripheral_Access_Layer BLE2_REG Peripheral Access Layer
 * @{
 */

/** BLE2_REG - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[512];
  __IO uint32_t BLE_REG_TXRX_CCM_SESSION_KEY_0;    /**< Session Key 0 for CCM Operation, offset: 0x200 */
  __IO uint32_t BLE_REG_TXRX_CCM_SESSION_KEY_1;    /**< Session Key 1 for CCM Operation, offset: 0x204 */
  __IO uint32_t BLE_REG_TXRX_CCM_SESSION_KEY_2;    /**< Session Key 2 for CCM Operation, offset: 0x208 */
  __IO uint32_t BLE_REG_TXRX_CCM_SESSION_KEY_3;    /**< Session Key 3 for CCM Operation, offset: 0x20C */
  __IO uint32_t BLE_REG_TXRX_CCM_INIT_VEC_0;       /**< Initialization Vector 0 for CCM Operation, offset: 0x210 */
  __IO uint32_t BLE_REG_TXRX_CCM_INIT_VEC_1;       /**< Initialization Vector 1 for CCM Operation, offset: 0x214 */
  __IO uint32_t BLE_REG_TX_CCM_PKT_CNT_0;          /**< Transmit CCM Packet Count 0, offset: 0x218 */
  __IO uint32_t BLE_REG_TX_CCM_PKT_CNT_1;          /**< Transmit CCM Packet Count 1, offset: 0x21C */
  __IO uint32_t BLE_REG_RX_CCM_PKT_CNT_0;          /**< Receive CCM Packet Count 0, offset: 0x220 */
  __IO uint32_t BLE_REG_RX_CCM_PKT_CNT_1;          /**< Receive CCM Packet Count 1, offset: 0x224 */
  __IO uint32_t BLE_REG_TXRX_CNTRL;                /**< Transmit/Receive Packet Control, offset: 0x228 */
  __IO uint32_t BLE_REG_TXRX_CRC_INIT_VAL;         /**< CRC Initialization Value, offset: 0x22C */
  __IO uint32_t BLE_REG_TX_ACC_ADDR;               /**< Tx Access Address, for Advt and Data Packets, offset: 0x230 */
       uint8_t RESERVED_1[12];
  __I  uint32_t BLE_REG_RX_PKT_STATUS;             /**< Rx Packet Status, for Advt and Data Packets, offset: 0x240 */
       uint8_t RESERVED_2[12];
  __IO uint32_t BLE_REG_TXRX_CCM_CNTRL;            /**< CCM Operation (encryption/authentication) Control, offset: 0x250 */
       uint8_t RESERVED_3[4];
  __I  uint32_t BLE_REG_TXRX_CORHIT_QUS_TIMESTAMP; /**< Quarter microsecond level timestamp, offset: 0x258 */
  __I  uint32_t BLE_REG_TXRX_CORHIT_MCCLOCK_TIMESTAMP; /**< Native clock timestamp, offset: 0x25C */
  __I  uint32_t BLE_REG_TXRX_PKTEND_QUS_TIMESTAMP; /**< Quarter microsecond level timestamp, offset: 0x260 */
  __I  uint32_t BLE_REG_TXRX_PKTEND_MCCLOCK_TIMESTAMP; /**< Native clock timestamp, offset: 0x264 */
       uint8_t RESERVED_4[8];
  __IO uint32_t BLE_REG_TXRX_ERR_INJ_CNTRL;        /**< TxRx Error Injection Control, offset: 0x270 */
  __IO uint32_t BLE_REG_TXRX_CRC_CORRUPT;          /**< TxRx CRC Corruption Control, offset: 0x274 */
       uint8_t RESERVED_5[24];
  __IO uint32_t BLE_REG_RL_START_ADDR;             /**< Register Loader Start Address, offset: 0x290 */
  __IO uint32_t BLE_REG_RL_CNTRL_STS;              /**< Register Loader Control and Status, offset: 0x294 */
  __IO uint32_t BLE_REG_DFE_PKT_EXTENSION_CNTRL;   /**< Tx/Rx Packet Extension Control, offset: 0x298 */
  __IO uint32_t BLE_REG_RX_ADV_PDU_TYPE;           /**< Rx Advertising Packet PDU Type, offset: 0x29C */
  __IO uint32_t BLE_REG_PRNG_CTRL_STS;             /**< PRNG Control Status, offset: 0x2A0 */
  __IO uint32_t BLE_REG_PRNG_IN;                   /**< PRNG Input, offset: 0x2A4 */
  __I  uint32_t BLE_REG_PRNG_OUT;                  /**< PRNG Output, offset: 0x2A8 */
       uint8_t RESERVED_6[44];
  __IO uint32_t BLE_REG_CODED_PKT_CNTRL;           /**< LE Coded Packet Control, offset: 0x2D8 */
  __IO uint32_t BLE_REG_IRK_BASE_ADDR;             /**< IRK Resolution Base address, offset: 0x2DC */
  __IO uint32_t BLE_REG_IRK_CTRL_0;                /**< IRK Resolution Control 0, offset: 0x2E0 */
  __IO uint32_t BLE_REG_IRK_CTRL_1;                /**< IRK Resolution Control 1, offset: 0x2E4 */
  __I  uint32_t BLE_REG_IRK_STATUS_0;              /**< IRK Resolution Status 0, offset: 0x2E8 */
  __I  uint32_t BLE_REG_IRK_STATUS_1;              /**< IRK Resolution Status 1, offset: 0x2EC */
  __IO uint32_t BLE_REG_WHITELIST_BASE_ADDR;       /**< Whitelist Base address, offset: 0x2F0 */
  __IO uint32_t BLE_REG_WHITELIST_CTRL_0;          /**< Whitelist Search Control 0, offset: 0x2F4 */
  __IO uint32_t BLE_REG_WHITELIST_CTRL_1;          /**< Whitelist Search Control 1, offset: 0x2F8 */
  __I  uint32_t BLE_REG_WHITELIST_STATUS;          /**< Whitelist Search Status, offset: 0x2FC */
  __IO uint32_t BLE_REG_TD_START_ADDR;             /**< Tx Descriptor Start Address, offset: 0x300 */
  __I  uint32_t BLE_REG_TD_STATUS;                 /**< Tx Descriptor Status, offset: 0x304 */
       uint8_t RESERVED_7[248];
  __IO uint32_t BLE_REG_RD_START_ADDR;             /**< Rx Descriptor Start Address, offset: 0x400 */
  __I  uint32_t BLE_REG_RD_STATUS;                 /**< Rx Descriptor Status, offset: 0x404 */
       uint8_t RESERVED_8[256];
  __IO uint32_t BLE_REG_CLK_CTRL_SLEEP_OK_TIMER;   /**< BLE sleep ok timer, offset: 0x508 */
       uint8_t RESERVED_9[244];
  __IO uint32_t BLE_REG_AES_CNTRL;                 /**< AES Control, offset: 0x600 */
       uint8_t RESERVED_10[12];
  __IO uint32_t BLE_REG_AES_KEY_0;                 /**< Key 0 for Software AES encryption, offset: 0x610 */
  __IO uint32_t BLE_REG_AES_KEY_1;                 /**< Key 1 for Software AES encryption, offset: 0x614 */
  __IO uint32_t BLE_REG_AES_KEY_2;                 /**< Key 2 for Software AES encryption, offset: 0x618 */
  __IO uint32_t BLE_REG_AES_KEY_3;                 /**< Key 3 for Software AES encryption, offset: 0x61C */
  __IO uint32_t BLE_REG_AES_DIN_0;                 /**< Raw Data Input 0 for Software AES encryption, offset: 0x620 */
  __IO uint32_t BLE_REG_AES_DIN_1;                 /**< Raw Data Input 1 for Software AES encryption, offset: 0x624 */
  __IO uint32_t BLE_REG_AES_DIN_2;                 /**< Raw Data Input 2 for Software AES encryption, offset: 0x628 */
  __IO uint32_t BLE_REG_AES_DIN_3;                 /**< Raw Data Input 3 for Software AES encryption, offset: 0x62C */
  __I  uint32_t BLE_REG_AES_DOUT_0;                /**< AES Encrypted Data Output 0, offset: 0x630 */
  __I  uint32_t BLE_REG_AES_DOUT_1;                /**< AES Encrypted Data Output 1, offset: 0x634 */
  __I  uint32_t BLE_REG_AES_DOUT_2;                /**< AES Encrypted Data Output 2, offset: 0x638 */
  __I  uint32_t BLE_REG_AES_DOUT_3;                /**< AES Encrypted Data Output 3, offset: 0x63C */
       uint8_t RESERVED_11[192];
  __IO uint32_t BLE_REG_INT_MASK_0;                /**< BLE Interrupt Mask 0, offset: 0x700 */
  __IO uint32_t BLE_REG_INT_MASK_1;                /**< BLE Interrupt Mask 0/1, offset: 0x704 */
  __IO uint32_t BLE_REG_INT_MASK_2;                /**< BLE Interrupt Mask 2, offset: 0x708 */
  __IO uint32_t BLE_REG_HW_ABORT_MASK;             /**< BLE Interrupt Mask, hardware Abort, offset: 0x70C */
  __IO uint32_t BLE_REG_RT_ERR_MASK;               /**< BLE Interrupt Mask, Real-time Error, offset: 0x710 */
       uint8_t RESERVED_12[44];
  __IO uint32_t BLE_REG_INT_STS_0;                 /**< BLE Interrupt Status 0, offset: 0x740 */
  __IO uint32_t BLE_REG_INT_STS_1;                 /**< BLE Interrupt Status 1, offset: 0x744 */
  __IO uint32_t BLE_REG_INT_STS_2;                 /**< BLE Interrupt Status 2, offset: 0x748 */
  __IO uint32_t BLE_REG_HW_ABORT_STS;              /**< BLE Interrupt Status, hardware Abort, offset: 0x74C */
  __IO uint32_t BLE_REG_RT_ERR_STS;                /**< BLE Interrupt Status, Real-time Error, offset: 0x750 */
       uint8_t RESERVED_13[44];
  __IO uint32_t BLE_REG_INT_CFG_01;                /**< BLE Interrupt Configuration, offset: 0x780 */
  __IO uint32_t BLE_REG_INT_DELAY_CTRL_01;         /**< BLE Interrupt Delay Control, offset: 0x784 */
  __I  uint32_t BLE_REG_INT_SW_MBOX;               /**< Software Mailbox Interrupt, offset: 0x788 */
       uint8_t RESERVED_14[116];
  __IO uint32_t BLE_REG_TMR_SWT_CTL_0;             /**< Software Timer 0: Control, offset: 0x800 */
  __IO uint32_t BLE_REG_TMR_SWT_VALUE_0;           /**< Software Timer 0: Expiration Value, offset: 0x804 */
  __I  uint32_t BLE_REG_TMR_SWT_STS_0;             /**< Software Timer 0: Expiration Status, offset: 0x808 */
       uint8_t RESERVED_15[4];
  __IO uint32_t BLE_REG_TMR_SWT_CTL_1;             /**< Software Timer 1: Control, offset: 0x810 */
  __IO uint32_t BLE_REG_TMR_SWT_VALUE_1;           /**< Software Timer 1: Expiration Value, offset: 0x814 */
  __I  uint32_t BLE_REG_TMR_SWT_STS_1;             /**< Software Timer 1: Expiration Status, offset: 0x818 */
       uint8_t RESERVED_16[4];
  __IO uint32_t BLE_REG_TMR_SWT_CTL_2;             /**< Software Timer 2: Control, offset: 0x820 */
  __IO uint32_t BLE_REG_TMR_SWT_VALUE_2;           /**< Software Timer 2: Expiration Value, offset: 0x824 */
  __I  uint32_t BLE_REG_TMR_SWT_STS_2;             /**< Software Timer 2: Expiration Status, offset: 0x828 */
       uint8_t RESERVED_17[4];
  __IO uint32_t BLE_REG_TMR_SWT_CTL_3;             /**< Software Timer 3: Control, offset: 0x830 */
  __IO uint32_t BLE_REG_TMR_SWT_VALUE_3;           /**< Software Timer 3: Expiration Value, offset: 0x834 */
  __I  uint32_t BLE_REG_TMR_SWT_STS_3;             /**< Software Timer 3: Expiration Status, offset: 0x838 */
  __I  uint32_t BLE_REG_TMR_NATIVE_QUS;            /**< Native quarter microsecond counter Value, offset: 0x83C */
  __I  uint32_t BLE_REG_TMR_NATIVE_CLOCK;          /**< Native mcClock Value, offset: 0x840 */
  __IO uint32_t BLE_REG_TMR_WAKEUP_DELAY_LPO_CYCLES; /**< Wakeup delay value in LPO cycles, offset: 0x844 */
  __I  uint32_t BLE_REG_TMR_CLOCK_SKIP;            /**< Native Clock Value, offset: 0x848 */
       uint8_t RESERVED_18[4];
  __IO uint32_t BLE_REG_TMR_CDT_CTL_0;             /**< Qus Count Down Timer 0: Control, offset: 0x850 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_0;           /**< Count Down Timer 0: Count Value, offset: 0x854 */
  __IO uint32_t BLE_REG_TMR_CDT_CTL_1;             /**< Qus Count Down Timer 1: Control, offset: 0x858 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_1;           /**< Count Down Timer 1: Count Value, offset: 0x85C */
  __IO uint32_t BLE_REG_TMR_CDT_CTL_2;             /**< Qus Count Down Timer 2: Control, offset: 0x860 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_2;           /**< Count Down Timer 2: Count Value, offset: 0x864 */
  __IO uint32_t BLE_REG_TMR_CDT_CTL_3;             /**< Qus Count Down Timer 3: Control, offset: 0x868 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_3;           /**< Count Down Timer 3: Count Value, offset: 0x86C */
  __IO uint32_t BLE_REG_TMR_CDT_CTL_4;             /**< Qus Count Down Timer 4: Control, offset: 0x870 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_4;           /**< Count Down Timer 4: Count Value, offset: 0x874 */
  __IO uint32_t BLE_REG_TMR_CDT_CTL_5;             /**< Qus Count Down Timer 5: Control, offset: 0x878 */
  __IO uint32_t BLE_REG_TMR_CDT_VALUE_5;           /**< Count Down Timer 5: Count Value, offset: 0x87C */
  __IO uint32_t BLE_REG_TMR_CDT_2M_DATA_ADJ;       /**< Qus Count Offset Register: LE 2M, offset: 0x880 */
  __IO uint32_t BLE_REG_TMR_CDT_CI_TX_DATA_ADJ;    /**< Qus Count Offset Register: LE Coded Tx, offset: 0x884 */
  __IO uint32_t BLE_REG_TMR_CDT_CI_RX_DATA_ADJ_0;  /**< Qus Count Offset Register: LE Coded Rx 0, offset: 0x888 */
  __IO uint32_t BLE_REG_TMR_CDT_CI_RX_DATA_ADJ_1;  /**< Qus Count Offset Register: LE Coded Rx 1, offset: 0x88C */
  __IO uint32_t BLE_REG_TMR_CDT_CI_RX_DATA_ADJ_2;  /**< Qus Count Offset Register: LE Coded Rx 2, offset: 0x890 */
  __IO uint32_t BLE_REG_TMR_CDT_CI_RX_DATA_ADJ_3;  /**< Qus Count Offset Register: LE Coded Rx 3, offset: 0x894 */
  __IO uint32_t BLE_REG_TMR_CDT_CI_RX_DATA_ADJ_4;  /**< Qus Count Offset Register: LE Coded Rx 4, offset: 0x898 */
       uint8_t RESERVED_19[100];
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_CNTRL;       /**< Tx Antenna Switch Control, offset: 0x900 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_0;       /**< Tx Antenna Switch Map: Map 0, offset: 0x904 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_1;       /**< Tx Antenna Switch Map: Map 1, offset: 0x908 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_2;       /**< Tx Antenna Switch Map: Map 2, offset: 0x90C */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_3;       /**< Tx Antenna Switch Map: Map 3, offset: 0x910 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_4;       /**< Tx Antenna Switch Map: Map 4, offset: 0x914 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_5;       /**< Tx Antenna Switch Map: Map 5, offset: 0x918 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_6;       /**< Tx Antenna Switch Map: Map 6, offset: 0x91C */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_7;       /**< Tx Antenna Switch Map: Map 7, offset: 0x920 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_8;       /**< Tx Antenna Switch Map: Map 8, offset: 0x924 */
  __IO uint32_t BLE_REG_ANT_SWITCH_TX_MAP_9;       /**< Tx Antenna Switch Map: Map 9, offset: 0x928 */
       uint8_t RESERVED_20[4];
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_CNTRL;       /**< Rx Antenna Switch Control, offset: 0x930 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_0;       /**< Rx Antenna Switch Map: Map 0, offset: 0x934 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_1;       /**< Rx Antenna Switch Map: Map 1, offset: 0x938 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_2;       /**< Rx Antenna Switch Map: Map 2, offset: 0x93C */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_3;       /**< Rx Antenna Switch Map: Map 3, offset: 0x940 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_4;       /**< Rx Antenna Switch Map: Map 4, offset: 0x944 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_5;       /**< Rx Antenna Switch Map: Map 5, offset: 0x948 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_6;       /**< Rx Antenna Switch Map: Map 6, offset: 0x94C */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_7;       /**< Rx Antenna Switch Map: Map 7, offset: 0x950 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_8;       /**< Rx Antenna Switch Map: Map 8, offset: 0x954 */
  __IO uint32_t BLE_REG_ANT_SWITCH_RX_MAP_9;       /**< Rx Antenna Switch Map: Map 9, offset: 0x958 */
       uint8_t RESERVED_21[164];
  __IO uint32_t BLE_REG_PST_CTRL_0;                /**< Periodic SW Timer 0: Control, offset: 0xA00 */
  __IO uint32_t BLE_REG_PST_STS_0;                 /**< Periodic SW Timer 0: Status, offset: 0xA04 */
  __IO uint32_t BLE_REG_PST_FRST_ANCHR_0;          /**< Periodic SW Timer 0: First Anchor, offset: 0xA08 */
  __IO uint32_t BLE_REG_PST_ANCHR_OFST_0;          /**< Periodic SW Timer 0: First Anchor Offset, offset: 0xA0C */
  __IO uint32_t BLE_REG_PST_ANCHR_ADJ_0;           /**< Periodic SW Timer 0: Anchor Adjustment, offset: 0xA10 */
  __IO uint32_t BLE_REG_PST_INTVL_0;               /**< Periodic SW Timer 0: ISO Interval, offset: 0xA14 */
  __IO uint32_t BLE_REG_PST_SPC_0;                 /**< Periodic SW Timer 0: Spacing, offset: 0xA18 */
  __IO uint32_t BLE_REG_PST_SEL_STRM_0;            /**< Periodic SW Timer 0: Select Stream, offset: 0xA1C */
  __IO uint32_t BLE_REG_PST_SYNC_DLY_0;            /**< Periodic SW Timer 0: Group Sync Delay, offset: 0xA20 */
  __IO uint32_t BLE_REG_PST_SE_CTRL_0;             /**< Periodic SW Timer 0: SubEvent Control, offset: 0xA24 */
  __IO uint32_t BLE_REG_PST_SE_INTVL_0;            /**< Periodic SW Timer 0: SubEvent Interval, offset: 0xA28 */
  __I  uint32_t BLE_REG_PST_SE_DIS_0;              /**< Periodic SW Timer 0: SubEvent Disable, offset: 0xA2C */
  __IO uint32_t BLE_REG_PST_CTRL_1;                /**< Periodic SW Timer 1: Control, offset: 0xA30 */
  __IO uint32_t BLE_REG_PST_STS_1;                 /**< Periodic SW Timer 1: Status, offset: 0xA34 */
  __IO uint32_t BLE_REG_PST_FRST_ANCHR_1;          /**< Periodic SW Timer 1: First Anchor, offset: 0xA38 */
  __IO uint32_t BLE_REG_PST_ANCHR_OFST_1;          /**< Periodic SW Timer 1: First Anchor Offset, offset: 0xA3C */
  __IO uint32_t BLE_REG_PST_ANCHR_ADJ_1;           /**< Periodic SW Timer 1: Anchor Adjustment, offset: 0xA40 */
  __IO uint32_t BLE_REG_PST_INTVL_1;               /**< Periodic SW Timer 1: ISO Interval, offset: 0xA44 */
  __IO uint32_t BLE_REG_PST_SPC_1;                 /**< Periodic SW Timer 1: Spacing, offset: 0xA48 */
  __IO uint32_t BLE_REG_PST_SEL_STRM_1;            /**< Periodic SW Timer 1: Select Stream, offset: 0xA4C */
  __IO uint32_t BLE_REG_PST_SYNC_DLY_1;            /**< Periodic SW Timer 1: Group Sync Delay, offset: 0xA50 */
  __IO uint32_t BLE_REG_PST_SE_CTRL_1;             /**< Periodic SW Timer 1: SubEvent Control, offset: 0xA54 */
  __IO uint32_t BLE_REG_PST_SE_INTVL_1;            /**< Periodic SW Timer 1: SubEvent Interval, offset: 0xA58 */
  __I  uint32_t BLE_REG_PST_SE_DIS_1;              /**< Periodic SW Timer 1: SubEvent Disable, offset: 0xA5C */
  __IO uint32_t BLE_REG_PST_CTRL_2;                /**< Periodic SW Timer 2: Control, offset: 0xA60 */
  __IO uint32_t BLE_REG_PST_STS_2;                 /**< Periodic SW Timer 2: Status, offset: 0xA64 */
  __IO uint32_t BLE_REG_PST_FRST_ANCHR_2;          /**< Periodic SW Timer 2: First Anchor, offset: 0xA68 */
  __IO uint32_t BLE_REG_PST_ANCHR_OFST_2;          /**< Periodic SW Timer 2: First Anchor Offset, offset: 0xA6C */
  __IO uint32_t BLE_REG_PST_ANCHR_ADJ_2;           /**< Periodic SW Timer 2: Anchor Adjustment, offset: 0xA70 */
  __IO uint32_t BLE_REG_PST_INTVL_2;               /**< Periodic SW Timer 2: ISO Interval, offset: 0xA74 */
  __IO uint32_t BLE_REG_PST_SPC_2;                 /**< Periodic SW Timer 2: Spacing, offset: 0xA78 */
  __IO uint32_t BLE_REG_PST_SEL_STRM_2;            /**< Periodic SW Timer 2: Select Stream, offset: 0xA7C */
  __IO uint32_t BLE_REG_PST_SYNC_DLY_2;            /**< Periodic SW Timer 2: Group Sync Delay, offset: 0xA80 */
  __IO uint32_t BLE_REG_PST_SE_CTRL_2;             /**< Periodic SW Timer 2: SubEvent Control, offset: 0xA84 */
  __IO uint32_t BLE_REG_PST_SE_INTVL_2;            /**< Periodic SW Timer 2: SubEvent Interval, offset: 0xA88 */
  __I  uint32_t BLE_REG_PST_SE_DIS_2;              /**< Periodic SW Timer 2: SubEvent Disable, offset: 0xA8C */
       uint8_t RESERVED_22[880];
  __IO uint32_t BLE_REG_AHBW_FSM_MON_CNTRL;        /**< BLE AHBW FSM Monitor and Reset Control, offset: 0xE00 */
  __IO uint32_t BLE_REG_RX_FSM_MON_CNTRL;          /**< BLE Rx FSM Monitor and Reset Control, offset: 0xE04 */
  __IO uint32_t BLE_REG_TX_FSM_MON_CNTRL;          /**< BLE Tx FSM Monitor and Reset Control, offset: 0xE08 */
  __IO uint32_t BLE_REG_CCM_FSM_MON_CNTRL;         /**< BLE CCM FSM Monitor and Reset Control, offset: 0xE0C */
  __IO uint32_t BLE_REG_DEBUG_CNTRL;               /**< BLE Debug Test Bus Control, offset: 0xE10 */
  __IO uint32_t BLE_REG_DEBUG_BANK_SEL;            /**< BLE debug test bus bank selection set, offset: 0xE14 */
       uint8_t RESERVED_23[8];
  __I  uint32_t BLE_REG_IP_REVISION;               /**< BTU IP Revision, offset: 0xE20 */
       uint8_t RESERVED_24[12];
  __IO uint32_t BLE_REG_AES_MARGIN;                /**< BLE AES Margin, offset: 0xE30 */
  __IO uint32_t BLE_REG_DMA_MARGIN;                /**< BLE DMA Margin, offset: 0xE34 */
       uint8_t RESERVED_25[4];
  __IO uint32_t BLE_REG_AHB_LAT;                   /**< BLE AHB Latency Monitors, offset: 0xE3C */
       uint8_t RESERVED_26[64];
  __IO uint32_t BLE_REG_DEBUG_RVSD;                /**< Debug reserved, offset: 0xE80 */
} BLE2_REG_Type;

/* ----------------------------------------------------------------------------
   -- BLE2_REG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup BLE2_REG_Register_Masks BLE2_REG Register Masks
 * @{
 */

