MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_PRNG_DONE_MASK (0x2U)
#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_PRNG_DONE_SHIFT (1U)
/*! PRNG_Done - PRNG done */
#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_PRNG_DONE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_CTRL_STS_PRNG_DONE_SHIFT)) & BLE2_REG_BLE_REG_PRNG_CTRL_STS_PRNG_DONE_MASK)

#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_SUBEVENT_MODE_MASK (0x4U)
#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_SUBEVENT_MODE_SHIFT (2U)
/*! Subevent_Mode - Selects mode of operation */
#define BLE2_REG_BLE_REG_PRNG_CTRL_STS_SUBEVENT_MODE(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_CTRL_STS_SUBEVENT_MODE_SHIFT)) & BLE2_REG_BLE_REG_PRNG_CTRL_STS_SUBEVENT_MODE_MASK)
/*! @} */

/*! @name BLE_REG_PRNG_IN - PRNG Input */
/*! @{ */

#define BLE2_REG_BLE_REG_PRNG_IN_CHNL_ID_MASK    (0xFFFFU)
#define BLE2_REG_BLE_REG_PRNG_IN_CHNL_ID_SHIFT   (0U)
/*! Chnl_Id - Channel index */
#define BLE2_REG_BLE_REG_PRNG_IN_CHNL_ID(x)      (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_IN_CHNL_ID_SHIFT)) & BLE2_REG_BLE_REG_PRNG_IN_CHNL_ID_MASK)

#define BLE2_REG_BLE_REG_PRNG_IN_XOR_IN_MASK     (0xFFFF0000U)
#define BLE2_REG_BLE_REG_PRNG_IN_XOR_IN_SHIFT    (16U)
/*! XOR_In - Counter input */
#define BLE2_REG_BLE_REG_PRNG_IN_XOR_IN(x)       (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_IN_XOR_IN_SHIFT)) & BLE2_REG_BLE_REG_PRNG_IN_XOR_IN_MASK)
/*! @} */

/*! @name BLE_REG_PRNG_OUT - PRNG Output */
/*! @{ */

#define BLE2_REG_BLE_REG_PRNG_OUT_MAM_OUT_MASK   (0xFFFFU)
#define BLE2_REG_BLE_REG_PRNG_OUT_MAM_OUT_SHIFT  (0U)
/*! MAM_Out - Pseudorandom output */
#define BLE2_REG_BLE_REG_PRNG_OUT_MAM_OUT(x)     (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_OUT_MAM_OUT_SHIFT)) & BLE2_REG_BLE_REG_PRNG_OUT_MAM_OUT_MASK)

#define BLE2_REG_BLE_REG_PRNG_OUT_XOR_OUT_MASK   (0xFFFF0000U)
#define BLE2_REG_BLE_REG_PRNG_OUT_XOR_OUT_SHIFT  (16U)
/*! XOR_Out - Pseudorandom output */
#define BLE2_REG_BLE_REG_PRNG_OUT_XOR_OUT(x)     (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_PRNG_OUT_XOR_OUT_SHIFT)) & BLE2_REG_BLE_REG_PRNG_OUT_XOR_OUT_MASK)
/*! @} */

/*! @name BLE_REG_CODED_PKT_CNTRL - LE Coded Packet Control */
/*! @{ */

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_EN_MASK (0x1U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_EN_SHIFT (0U)
/*! tx_coded_pkt_en - Tx Coded Packet Enable
 *  0b0..regular, use non-coded PHY to transmit packet
 *  0b1..use LE coded PHY to transmit packet
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_EN_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_EN_MASK)

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_INDIC_MASK (0x30U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_INDIC_SHIFT (4U)
/*! tx_coded_pkt_indic - Tx Coded Packet Indicator */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_INDIC(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_INDIC_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_TX_CODED_PKT_INDIC_MASK)

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_RX_CODED_PKT_EN_MASK (0x10000U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_RX_CODED_PKT_EN_SHIFT (16U)
/*! rx_coded_pkt_en - Rx Coded Packet Enable
 *  0b0..regular, use non-coded PHY to receive packet
 *  0b1..use LE coded PHY to receive packet
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_RX_CODED_PKT_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_RX_CODED_PKT_EN_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_RX_CODED_PKT_EN_MASK)

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_MASK (0x20000U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_SHIFT (17U)
/*! simul_scan_en - Simultaneous Scan Enable
 *  0b0..disable
 *  0b1..enable. When enabled, rx_coded_pkt_en bit must set to 0.
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_EN_MASK)

#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_MASK (0x40000U)
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_SHIFT (18U)
/*! simul_scan_1m - Simultaneous Scan Results in 1M Mode, if Concurrent Correlation Hit.
 *  0b0..Continue Rx in coded PHY packet mode - preferred as it takes longer time to correlate the access address.
 *  0b1..Continue Rx in BLE 1M mode.
 */
#define BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_SHIFT)) & BLE2_REG_BLE_REG_CODED_PKT_CNTRL_SIMUL_SCAN_1M_MASK)
/*! @} */

/*! @name BLE_REG_IRK_BASE_ADDR - IRK Resolution Base address */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_MASK (0x3FFFU)
#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_SHIFT (0U)
/*! irk_base_addr - IRK Base Address */
#define BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_SHIFT)) & BLE2_REG_BLE_REG_IRK_BASE_ADDR_IRK_BASE_ADDR_MASK)
/*! @} */

/*! @name BLE_REG_IRK_CTRL_0 - IRK Resolution Control 0 */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_MASK (0xFFFFFFU)
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_SHIFT (0U)
/*! sw_irk_hash - Software provided hash for IRK resolution */
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_HASH_MASK)

#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_SHIFT (24U)
/*! sw_irk_prand - Software provided prand for IRK resolution */
#define BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_0_SW_IRK_PRAND_MASK)
/*! @} */

/*! @name BLE_REG_IRK_CTRL_1 - IRK Resolution Control 1 */
/*! @{ */

#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_MASK (0xFFFFU)
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_SHIFT (0U)
/*! sw_irk_prand - Software provided hash for IRK resolution */
#define BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_SHIFT)) & BLE2_REG_BLE_REG_IRK_CTRL_1_SW_IRK_PRAND_MASK)

