MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_SHIFT (8U)
/*! hw_wl_lookup_position - Position of last hardware whitelist lookup in EBRAM */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_HW_WL_LOOKUP_POSITION_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_MASK (0x30000U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_SHIFT (16U)
/*! sw_wl_lookup_result - Result of latest software white list lookup
 *  0b00..lookup in progress
 *  0b01..entry was found in whitelist
 *  0b10..entry was not found in whitelist
 *  0b11..whitelist search not done for this software command
 */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_RESULT_MASK)

#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_MASK (0xFF000000U)
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_SHIFT (24U)
/*! sw_wl_lookup_position - Position of last software whitelist lookup in EBRAM */
#define BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_SHIFT)) & BLE2_REG_BLE_REG_WHITELIST_STATUS_SW_WL_LOOKUP_POSITION_MASK)
/*! @} */

/*! @name BLE_REG_TD_START_ADDR - Tx Descriptor Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_SHIFT (0U)
/*! td_start_address - Tx Descriptor Start Address */
#define BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_TD_START_ADDR_TD_START_ADDRESS_MASK)
/*! @} */

/*! @name BLE_REG_TD_STATUS - Tx Descriptor Status */
/*! @{ */

#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_MASK  (0x1U)
#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_SHIFT (0U)
/*! td_busy - TD busy
 *  0b0..TD is idle
 *  0b1..TD is busy and being used by hardware
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TD_BUSY_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_MASK (0x4U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_SHIFT (2U)
/*! tx_extn_ant_switch_fail - Tx antenna switch status on packet extension
 *  0b0..Tx antenna switch pattern is honored; antSwitchStatus was never de-asserted during packet extension
 *  0b1..Tx antenna switch pattern is not honored
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ANT_SWITCH_FAIL_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_SHIFT (3U)
/*! tx_extn_abort - Tx extension packet hardware abort status
 *  0b0..No abort condition happened during Tx extension
 *  0b1..hardware abort condition was detected during Tx extension
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_EXTN_ABORT_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_MASK (0x10U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_SHIFT (4U)
/*! tx_has_err - Tx Has Error
 *  0b0..No error
 *  0b1..At least 1 of rif_abort_tx, tx_dmem_underflow_intr, and tx_aes_underflow_intr has been asserted during packet transmission
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_HAS_ERR_MASK)

#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_MASK (0x20U)
#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_SHIFT (5U)
/*! tx_dma_err - Tx Has DMA Error
 *  0b0..No error
 *  0b1..SoC DMA slave has replied with ERROR response during packet transmission
 */
#define BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_SHIFT)) & BLE2_REG_BLE_REG_TD_STATUS_TX_DMA_ERR_MASK)
/*! @} */

/*! @name BLE_REG_RD_START_ADDR - Rx Descriptor Start Address */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_SHIFT (0U)
/*! rd_start_address - Rx Descriptor Start Address */
#define BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_SHIFT)) & BLE2_REG_BLE_REG_RD_START_ADDR_RD_START_ADDRESS_MASK)
/*! @} */

/*! @name BLE_REG_RD_STATUS - Rx Descriptor Status */
/*! @{ */

#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_MASK  (0x1U)
#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_SHIFT (0U)
/*! rd_busy - RD busy
 *  0b0..RD is idle
 *  0b1..RD is busy and being used by hardware
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RD_BUSY_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_MASK (0x2U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_SHIFT (1U)
/*! rx_extn_rcv - Extension Packet Received
 *  0b0..regular Rx packet was received
 *  0b1..extension field packet was received
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_RCV_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_MASK (0x4U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_SHIFT (2U)
/*! rx_extn_ant_switch_fail - Rx antenna switch status on packet extension
 *  0b0..Rx antenna switch pattern is honored; antSwitchStatus was never de-asserted during packet extension
 *  0b1..Rx antenna switch pattern is not honored
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ANT_SWITCH_FAIL_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_MASK (0x8U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_SHIFT (3U)
/*! rx_extn_abort - Rx extension packet hardware abort status
 *  0b0..no abort condition happened during Rx extension
 *  0b1..hardware abort condition was detected during Rx extension
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_ABORT_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_MASK (0x10U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_SHIFT (4U)
/*! rx_has_err - Rx Has Error
 *  0b0..No error
 *  0b1..At least 1 of rif_abort_rx, rx_dmem_overflow_intr, and rx_aes_underflow_intr has been asserted during packet reception
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_HAS_ERR_MASK)

