MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BLE2_REG.h
#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_MASK (0x20U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_SHIFT (5U)
/*! rx_dma_err - Rx Has DMA Error
 *  0b0..No error
 *  0b1..SoC DMA slave has replied with ERROR response during packet reception
 */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_DMA_ERR_MASK)

#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_MASK (0xFF00U)
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_SHIFT (8U)
/*! rx_extn_length - Rx Extension Length */
#define BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_SHIFT)) & BLE2_REG_BLE_REG_RD_STATUS_RX_EXTN_LENGTH_MASK)
/*! @} */

/*! @name BLE_REG_CLK_CTRL_SLEEP_OK_TIMER - BLE sleep ok timer */
/*! @{ */

#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_MASK (0x3FFU)
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_SHIFT (0U)
/*! sleep_ok_timer - sys_clk_sync_sleep_ok will deassert at timer expiration */
#define BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_SHIFT)) & BLE2_REG_BLE_REG_CLK_CTRL_SLEEP_OK_TIMER_SLEEP_OK_TIMER_MASK)
/*! @} */

/*! @name BLE_REG_AES_CNTRL - AES Control */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_MASK (0x1U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_SHIFT (0U)
/*! sw_aes_go_dyn - Run AES Encryption (active high pulse) */
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SW_AES_GO_DYN_MASK)

#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_MASK (0x2U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_SHIFT (1U)
/*! sw_ccm_clk_req - CCM/AES clock control
 *  0b0..disable clock for encryption
 *  0b1..request (enable) clock for encryption
 */
#define BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SW_CCM_CLK_REQ_MASK)

#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_MASK (0x4U)
#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_SHIFT (2U)
/*! secure_irk_decrypt_dyn - Decrypt IRK using DKey (active high pulse) */
#define BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_SECURE_IRK_DECRYPT_DYN_MASK)

#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_MASK (0x80000000U)
#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_SHIFT (31U)
/*! lock_sw_aes_regs - Lock Software AES registers from write
 *  0b0..All 12 Software AES registers (BLE_REG_AES_KEY_0~3, BLE_REG_AES_DIN_0~3, BLE_REG_AES_DOUT_0~3) can be written as normal.
 *  0b1..All 12 Software AES registers are read-only. Software and hardware write to them is disabled.
 */
#define BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_SHIFT)) & BLE2_REG_BLE_REG_AES_CNTRL_LOCK_SW_AES_REGS_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_0 - Key 0 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([31:0] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_0_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_1 - Key 1 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([63:32] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_1_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_2 - Key 2 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([95:64] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_2_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_KEY_3 - Key 3 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_SHIFT (0U)
/*! sw_aes_key - AES Key ([127:96] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_SHIFT)) & BLE2_REG_BLE_REG_AES_KEY_3_SW_AES_KEY_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_0 - Raw Data Input 0 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([31:0] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_0_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_1 - Raw Data Input 1 for Software AES encryption */
/*! @{ */

#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_MASK (0xFFFFFFFFU)
#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_SHIFT (0U)
/*! sw_aes_din - Raw Data Input for AES Encryption ([63:32] of 128-bit) */
#define BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_SHIFT)) & BLE2_REG_BLE_REG_AES_DIN_1_SW_AES_DIN_MASK)
/*! @} */

/*! @name BLE_REG_AES_DIN_2 - Raw Data Input 2 for Software AES encryption */
/*! @{ */

