MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/kw45z/thirdparty/kw45z/periph/PERI_BLE2_REG.h
/*! @name BLE_REG_INT_CFG_01 - BLE Interrupt Configuration */
/*! @{ */

#define BLE2_REG_BLE_REG_INT_CFG_01_RT_ERR_INTR_MASK (0x1U)
#define BLE2_REG_BLE_REG_INT_CFG_01_RT_ERR_INTR_SHIFT (0U)
/*! rt_err_intr - rt_err_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_RT_ERR_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_RT_ERR_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_RT_ERR_INTR_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_PST_2_INTR_MASK (0x8U)
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_2_INTR_SHIFT (3U)
/*! pst_2_intr - pst_2_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_2_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_PST_2_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_PST_2_INTR_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_PST_1_INTR_MASK (0x10U)
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_1_INTR_SHIFT (4U)
/*! pst_1_intr - pst_1_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_1_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_PST_1_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_PST_1_INTR_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_PST_0_INTR_MASK (0x20U)
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_0_INTR_SHIFT (5U)
/*! pst_0_intr - pst_0_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_PST_0_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_PST_0_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_PST_0_INTR_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_5_MASK (0x40U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_5_SHIFT (6U)
/*! cdt_expiry_intr_5 - cdt_expiry_intr[5] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_5(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_5_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_5_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_4_MASK (0x80U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_4_SHIFT (7U)
/*! cdt_expiry_intr_4 - cdt_expiry_intr[4] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_4(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_4_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_4_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_3_MASK (0x100U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_3_SHIFT (8U)
/*! cdt_expiry_intr_3 - cdt_expiry_intr[3] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_3_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_3_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_2_MASK (0x200U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_2_SHIFT (9U)
/*! cdt_expiry_intr_2 - cdt_expiry_intr[2] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_2_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_2_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_1_MASK (0x400U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_1_SHIFT (10U)
/*! cdt_expiry_intr_1 - cdt_expiry_intr[1] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_1_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_1_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_0_MASK (0x800U)
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_0_SHIFT (11U)
/*! cdt_expiry_intr_0 - cdt_expiry_intr[0] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_0_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_CDT_EXPIRY_INTR_0_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_3_MASK (0x1000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_3_SHIFT (12U)
/*! expiry_intr_3 - expiry_intr[3] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_3(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_3_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_3_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_2_MASK (0x2000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_2_SHIFT (13U)
/*! expiry_intr_2 - expiry_intr[2] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_2(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_2_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_2_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_1_MASK (0x4000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_1_SHIFT (14U)
/*! expiry_intr_1 - expiry_intr[1] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_1(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_1_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_1_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_0_MASK (0x8000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_0_SHIFT (15U)
/*! expiry_intr_0 - expiry_intr[0] interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_0(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_0_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_EXPIRY_INTR_0_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_TMR_ABORT_INTR_MASK (0x10000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_TMR_ABORT_INTR_SHIFT (16U)
/*! tmr_abort_intr - tmr_abort_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_TMR_ABORT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_TMR_ABORT_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_TMR_ABORT_INTR_MASK)

#define BLE2_REG_BLE_REG_INT_CFG_01_HW_ABORT_INTR_MASK (0x20000U)
#define BLE2_REG_BLE_REG_INT_CFG_01_HW_ABORT_INTR_SHIFT (17U)
/*! hw_abort_intr - hw_abort_intr interrupt configuration
 *  0b0..route to BLE_REG_INT_STS_0
 *  0b1..route to BLE_REG_INT_STS_1
 */
#define BLE2_REG_BLE_REG_INT_CFG_01_HW_ABORT_INTR(x) (((uint32_t)(((uint32_t)(x)) << BLE2_REG_BLE_REG_INT_CFG_01_HW_ABORT_INTR_SHIFT)) & BLE2_REG_BLE_REG_INT_CFG_01_HW_ABORT_INTR_MASK)

